{
  "users": [
    {
      "id": "1",
      "username": "Khalid",
      "password": "1234"
    },
    {
      "id": "2",
      "username": "Ali",
      "password": "1234"
    }
  ],
  "companies": [
    {
      "companyId": "elsewedy-electric",
      "name": "elsewedy electric",
      "isFollowing": false,
      "isVerified": true,
      "logo": "https://media.licdn.com/dms/image/v2/C560BAQF2a3ilv6hXXw/company-logo_200_200/company-logo_200_200/0/1631303609923?e=1747872000&v=beta&t=M9wVeJt_Zk6nNOEnz5X6PQVoUzb8wzaSFYK9JeRNA60",
      "description": "Manufacturer of Cables & Electrical Products and Integrated Infrastructure Provider",
      "companySize": "201-500 employees",
      "followers": 1000,
      "companyType": "Privately Held",
      "industry": "appliances,electrical and electronics",
      "overview": "A global leader that has evolved from a local manufacturer of electrical products into an integrated infrastructure solutions provider; with over 19,000 employees and with recorded revenues of more than USD 5 billion in 2023  . We Operate in five key business sectors: Wire, Cable & Accessories, Electrical Products, Engineering & Construction, Digital Solutions, and Infrastructure Investments. With a strong presence in 19 different countries, 31 production facilities spread across African and Asian countries including Egypt, Algeria, KSA, Qatar, Indonesia, Pakistan, and Tanzania. We export a wide range of high-end products to over 110 countries worldwide. At the heart of our approach is an all-in-one integrated Engineering, Procurement & Construction (EPC) service, enabling us to deliver the most complex turnkey projects on time and with the highest efficiency.A vital part of our mission is ensuring that the communities where we operate develop and flourish. We work to facilitate the global transition toward a sustainable energy future, whereby we established green energy projects and smart cities across Africa, the Middle East, and Eastern Europe. In alignment with our 2030 sustainability strategy, we aim to extend and enhance our positive impact, provide energy services to a growing customer base, and drive decarbonization, digitalization, and sustainable transition in Egypt and beyond. Our growth has been driven by hiring talents and empowering businesses and communities where we operate. We enable customers to digitize and meet the challenges of an ever-changing world. Our extensive range of digital solutions allows them to become smarter, faster, and more agile. We are committed to doing our best to serve our customers while caring for the environment. We aim to use our knowledge of our environmental impact to better develop more sustainable business scenarios and evaluate our future policies.",
      "founded": "1966",
      "website": "https://elsewedyelectric.com/en/default",
      "address": "New cairo,cairo",
      "location": "https://maps.app.goo.gl/fEh4pBYt6LvTFxQE8",
      "email": "elsewedyelectric@yahoo.com",
      "contactNumber": 19159,
      "banner": "https://media.licdn.com/dms/image/v2/D563DAQE4HioUznS0qQ/image-scale_191_1128/B56ZVMz7QJGoAg-/0/1740750438895/elsewedyelectric_cover?e=1742932800&v=beta&t=HbEGRLsXFRkcOVdzMal-2A-3-WhpsD5zRFZhShpQ6Fg",
      "verification_date": "March 01,2023",
      "specialities": "Cables & Accessories, Electrical Products, Energy Measurement & Management, Transformers, Communications, Wind Energy Generation, Solar Energy Solutions, Projects & Development, Cables, Power Generation solutions, Pivots, Telecommunication Solutions, Telecommunication Cables, Cable accessories, Wires, Copper Wires, Hydro power, Electrical solutions, Electrical projects, Energy Cables, Special Cables, OHTL & OPGW, Steel Products, Plastics, OIL & GAS SOLUTIONS, Metals, Telecom Cabling Solutions, Busway, Fiber Glass Poles, Motion Appliances, Engineering & Construction, Power Generation, Power Transmission, Power Distribution, Public & Civil Works, Water Solutions, Energy Management, Telecom Infrastructure, Telecommunication and Networking, Infrastructure Investments, Ports and logistics Development, and Utility Development"
    },
    {
      "companyId": "google",
      "name": "google",
      "description": "Manufacturer of Cables & Electrical Products and Integrated Infrastructure Provider",
      "industry": "aishaaaaaaaaa",
      "location": "https://maps.app.goo.gl/fEh4pBYt6LvTFxQE8",
      "logo": "https://media.licdn.com/dms/image/v2/C560BAQF2a3ilv6hXXw/company-logo_200_200/company-logo_200_200/0/1631303609923?e=1747872000&v=beta&t=M9wVeJt_Zk6nNOEnz5X6PQVoUzb8wzaSFYK9JeRNA60"
    },
    {
      "companyId": "zeft",
      "name": "zeft",
      "industry": "zefttttttt",
      "companySize": "201-500 employees",
      "companyType": "Government agency",
      "description": "zeft is a leading company in the zefttttttt sector."
    },
    {
      "companyId": "pepsi",
      "name": "pepsi",
      "industry": "soft drinks",
      "companySize": "11-50 employees",
      "companyType": "Nonprofit",
      "description": "pepsi is a leading company in the soft drinks sector."
    },
    {
      "companyId": "cocacola",
      "name": "cocacola",
      "industry": "soft drinks",
      "companySize": "11-50 employees",
      "companyType": "Public company",
      "description": "cocacola is a leading company in the soft drinks sector."
    },
    {
      "companyId": "pepsiegypt",
      "name": "pepsiegypt",
      "industry": "soft drinks",
      "companySize": "11-50 employees",
      "companyType": "Nonprofit",
      "description": "pepsiegypt is a leading company in the soft drinks sector."
    }
  ]
}